Backrooms/src/Enums/ТипыАккаунтов/ТипыАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАккаунтов</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>Участник</name>
  </enumValues>
  <enumValues>
    <name>Учащийся</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/CommonModules/СлужбаПользователяСервер/Module.bsl
Функция ВернутьТекПользователя() Экспорт
	Возврат ПараметрыСеанса.Пользователь;	
КонецФункции

Функция ПроверкаНаНовогоПользователя() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Наименование);
КонецФункции

Функция ПроверкаНаАдминистратора() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Администратор;
КонецФункции

Функция ПроверкаНаОрганизатора() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Организатор;
КонецФункции

Функция ПроверкаНаУчастника() Экспорт
	Возврат ПараметрыСеанса.Пользователь.ТипАккаунта = Перечисления.ТипыАккаунтов.Участник;
КонецФункции
